app/controllers/cinemas_controller.rb

SELECT * FROM `cinemas` WHERE (`cinemas`.`id` = 741846883)
SELECT * FROM `movies` WHERE (`movies`.`id` = 1)
SELECT * FROM `shows` WHERE (`shows`.cinema_id = 105) ORDER BY time ASC
SELECT `cinemas`.* FROM `cinemas` INNER JOIN `favourite_cinemas` ON `cinemas`.id = `favourite_cinemas`.cinema_id WHERE (`cinemas`.`id` = 741846883) AND ((`favourite_cinemas`.user_id = 922717376))
---
  def show
    @cinema = Cinema.find(params[:id])
    @shows = @cinema.shows.all(:include => :movie)