app/controllers/favourite_cinemas_controller.rb

INSERT INTO `favourite_cinemas` (`user_id`, `cinema_id`) VALUES(1050, NULL)
---
  def create
    @favourite_cinema = FavouriteCinema.new
    @favourite_cinema.user = current_user
    @favourite_cinema.cinema = Cinema.find(params[:cinema_id])

    if @favourite_cinema.save